"""
1)Перечислите атрибутивные свойства информации, дайте их 
краткую характеристику.
    - неотрывность от носителя информации
    - дискретность содержат в информации сведения те характеристики отдельные 
    фактические данные
    -непрерывность постоянно копится
2)Сформулируйте правило перевода дробных чисел из десятичной 
системы счисления в любую позиционную.
    Чтобы перевести десятичное смешанное число в позиционную систему счисления нужно 
    целую часть числа делить на основание сс в которую переводим. После делить частное до 
    тех пор пока остаток не станет меньше основания сс. В ответе записать остатки от деления 
    с права налево. Дробную же часть нужно умножать на основание сс в котрую переводим и 
    в ответ записывать целую часть, пока в дробной не останется чисел кроме нулей
3)Дайте классификацию информации по различным признакам (по 
способу представления, по способу восприятия, по массовому значению). 
Приведите примеры.
    по способу представления: знаковая, текстовая, графическая, аудиальная
    по способу восприятия: визуальная, аудиальная, вкусовая, осязаемая, 
    обонятельная
    по массовому значению: массовая, специальная, личная
4)Дайте классификацию каналов связи по физическим признакам.
    Механические, акустические, оптические и электрические. Проводные и 
    беспроводные 
5)В чем состоит процесс дискретизации информации и в каких 
случаях он используется? Приведите примеры. 
    Дискретизация информации – это процесс преобразования непрерывных аналоговых 
    сигналов особым образом, представление целого в виде набора отдельных элементов.  все 
    приборы, показывающие результаты измерения в цифрах, осуществляют дискретизацию.
6)Дайте классификацию каналов связи по способу передачи 
информации. 
    Симплексные передают информацию в одном направ-
    лении.
    Дуплексные передают информацию одновременно и в прямом, и обратном направлении.
    Полудуплексные осуществляют попеременную пере-
    дачу информации либо в прямом, либо в обратном
    направлении.
7) Приведите примеры информационных процессов в природе и 
технике в соответствии с универсальной схемой передачи информации.
    1. Исходная информация: Один человек пишет другому в соц сеть
    2. Шифрование: Символы кодируються через ascii
    3. Сжатие: Сжимаем файл для его передачи
    4. Шумозащитное кодирование: Прогоняем его через защиту, чтобы если файл с помехами, он мог самовосстановиться
    5. Канал связи: Чат в соц сети и   
    6. Шум: Файл получает некоторый шум при передаче
    7. Декодирование шумозащитных кодов: Убираем код защиты с сообщения
    8. Распаковка: Полученные данные распаковываются
    9. Дешифрование: Переводим из ascii в символы алфавита
    10. Полученная информация: Сообщение у другого человека
8)Дайте классификацию каналов связи по форме представления 
передаваемой информации.
    Аналоговые представляют информацию в непрерывной форме - в виде непрерывного 
    сигнала какой-либо физической природы.
    Цифровые представляют информацию в цифровой (прерывной - дискретной, импульсной) 
    форме сигналов какой-либо физической природы    
9)Какие формы представления информации существуют? 
Раскройте их основные характеристики.
    Знаковая(римские цифры, дорожные знаки), текстовая(текст), 
    графическая(фото), аудиальная, видео 
10)Дайте классификацию каналов связи по времени существования.
    Коммутируемые - временные, создаются только на время передачи информации. По 
    окончании передачи информации и разъединении уничтожаются.
    Некоммутируемые - создаются на длительное время с определенными постоянными 
    характеристиками. Их еще называют выделенными.      
11)Раскройте сущность понятия «количество информации».
    Количество информации – это мера, которая отражает степень снижения неопределенности, 
    возникающей при получении нового знания     
12)Что такое модуляция?
    Модуляция – изменение какого-либо параметра сигнала в канале связи (модулируемого 
    сигнала) в соответствии с текущими значениями передаваемых данных (т.е. 
    моделирующего сигнала).
13)Изобразите универсальную схему передачи информации в случае 
кодирования и объясните её.      
Исходная информация --> шифрование --> Сжатие --> Шумозащитное шифрование -->  Канал связи --> Декодирование защиты --> Распоковка --> Дешифрование --> Получение информации
14) Дайте определение протокола передачи данных.
    Протокол передачи данных - это совокупность правил, которые определяют формат 
    данных и процедуры передачи их по каналу связи, в которых, как правило, указываются 
    способ модуляции, соединение с каналом, представление данных и т.д. Все это делается 
    для повышения достоверности передаваемых
    данных.
15) Дайте определения понятий «информация», «данные», «знания» – 
как базовых понятий в информатике. Раскройте их взаимосвязь. Приведите 
примеры.
    Информация -- это сведения, снимающие неопределенность об окружа-
    ющем мире, которые являются объектом хранения, преобразования, передачи и 
    использования.
    Сведения - это знания, выраженные в сигналах, сообщениях, известиях,
    уведомлениях и т.д.
    знания – это опыт и восприятия человека в определённой сфере  
16)Что такое основание системы счисления?
Что такое основание системы счисления?
    Количество используемых в сс цифр       
17) Перечислите атрибутивные свойства информации, дайте их 
краткую характеристику.
    - неотрывность от носителя информации
    - дискретность содержат в информации сведения те характеристики отдельные 
    фактические данные
    -непрерывность постоянно копится    
18)Сформулируйте правило перевода дробных чисел из десятичной 
системы счисления в любую позиционную.
    Чтобы перевести десятичное смешанное число в позиционную систему счисления нужно 
    целую часть числа делить на основание сс в которую переводим. После делить частное до 
    тех пор пока остаток не станет меньше основания сс. В ответе записать остатки от деления 
    с права налево. Дробную же часть нужно умножать на основание сс в котрую переводим и 
    в ответ записывать целую часть, пока в дробной не останется чисел кроме нулей    
19)Какие форматы используются для представления чисел в памяти 
компьютера? В каком формате представляются целые числа в памяти ЭВМ?
Основные структурные единицы памяти компьютера: бит, байт, машин-
ное слово.
    Бит. Все данные и программы, хранящиеся в памяти компьютера, имеют вид двоичного 
    кода. Один символ из двухсимвольного алфавита несет 1 бит информации. Ячейка памяти, 
    хранящая один двоичный знак, называется «бит». В одном бите памяти хранится один бит 
    информации.
    Чтобы получить внутреннее представление целого положительного
    числа N, хранящегося в k-разрядном машинном слове, необходимо:
    l) перевести число N в двоичную систему счисления;
    2) полученный результат дополнить слева незначащими нулями до k раз-
    рядов.   
20)В чем состоит основная идея алгоритма Хаффмана?
    Идея алгоритма состоит в следующем: зная вероятности символов в сообщении, можно 
    описать процедуру построения кодов переменной длины, состоящих из целого количества 
    битов. Символам с большей вероятностью ставятся в соответствие более короткие коды. 
    Классический алгоритм Хаффмана на входе получает таблицу частот встречаемости 
    символов в сообщении. Далее на основании этой таблицы строится дерево кодирования 
    Хаффмана (Н-дерево).     
21)В чем состоит основная идея алгоритма Шеннона-Фано?
    При использовании этого метода выполняются следующие шаги:
    1) упорядочить множество исходных символов по убыванию их частот;
    2) список символов разделить на две части (назовем их первой и второй частями) так, 
    чтобы суммы частот обеих частей были точно или примерно равны. В случае, когда 
    точного равенства достичь не удается, разница между суммами должна быть минимальна;
    3) кодовым комбинациям первой части дописать 1, кодовым комбинациям
    второй части дописать 0:   
22)Нарисуйте универсальную схему передачи информации в случае 
кодирования. Охарактеризуйте назначение используемых в схеме устройств.    
1.Исходная информация - Передаваемое сообшение
2.шифрование - перевод его в нули и единицы
3.Сжатие - Умешьшение сообщение для передачи
4.Шумозащитное шифрование - Защита от помех
5.Канал связи - канал по которому идёт сообщение
6.Декодирование защиты  - Снитяе защиты с сообщение
7.Распоковка - распоковка сжатого до этого сообщения
8.Дешифрование - Перевод нулей и единиц в символы
9.Получение информации - передача сообщение в место 
23)Назовите существующие единицы измерения информации и 
соотношения между ними.
    Бит самая меньшая единица информации
    Байт = 8бит
    Килобайт = 1024байта
    Мегабайт = 1024 килобайта
    Гигабайт = 1024 мегабайта
    Петабайт = 1024 гигабайта
24)Перечислите прагматические свойства информации, дайте их 
краткую характеристику.
    -смысл и новизна (это свойство характеризует перемещение информации в 
    социальных коммуникациях, и выделяет ту ее часть, которая нова для 
    потребителя);
    -полезность (уменьшение неопределенности сведений об объекте, дезинформация 
    расценивается как отрицательные значения полезной информации);
    ценность (ценность информации различна для различных потребителей и 
    пользователей); 
    -кумулятивность (характеризует накопление и хранение информации);
    полнота (характеризует качество информации и определяет достаточность данных 
    для принятия решений или для создания новых данных на основе имеющихся; чем 
    полнее данные, тем шире диапазон методов, которые можно использовать, тем 
    проще подобрать метод, вносящий минимум погрешностей в ход 
    информационного процесса);
    -достоверность (данные возникают в момент регистрации сигналов, но не все 
    сигналы являются полезными - всегда присутствует какой-то уровень посторонних 
    сигналов, в результате чего полезные данные сопровождаются определенным 
    уровнем информационного шума; если полезный сигнал зарегистрирован более 
    четко, чем посторонние сигналы, достоверность информации может быть более 
    высокой; при увеличении уровня шумов достоверность информации снижается; в 
    этом случае для передачи того же количества информации требуется использовать 
    либо больше данных, либо более сложные методы);
    -адекватность (это степень соответствия реальному объективному состоянию дела; 
    неадекватная информация может образовываться при создании новой информации на 
    основе неполных или недостоверных данных; однако и полные, и достоверные данные 
    могут приводить к созданию неадекватной информации в случае применения к ним 
    неадекватных методов);
    -доступность (мера возможности получить ту или иную информацию; на степень 
    доступности информации влияют одновременно как доступность данных, так и 
    доступность адекватных методов для их интерпретации; отсутствие доступа к 
    данным или отсутствие адекватных методов обработки данных приводят к 
    одинаковому результату: информация оказывается недоступной; отсутствие 
    адекватных методов для работы с данными во многих случаях приводит к 
    применению неадекватных методов, в результате чего образуется неполная, 
    неадекватная или недостоверная информация);
    -актуальность (степень соответствия информации текущему моменту времени; 
    нередко с актуальностью, как и с полнотой, связывают коммерческую ценность 
    информации; поскольку информационные процессы растянуты во времени, то 
    достоверная и адекватная, но устаревшая информация может приводить к 
    ошибочным решениям; необходимость поиска (или разработки) адекватного 
    метода для работы с данными может приводить к такой задержке в получении 
    информации, что она становится неактуальной и ненужной; на этом, в частности, 
    основаны многие современные системы шифрования данных с открытым ключом. 
    Лица, не владеющие ключом (методом) для чтения данных, могут заняться 
    поиском ключа, поскольку алгоритм его работы доступен, но продолжительность 
    этого поиска столь велика, что за время работы информация теряет актуальность и, 
    соответственно, связанную с ней практическую ценность);
    -объективность и субъективность (понятие объективности информации является 
    относительным; это понятно, если учесть, что методы являются субъективными; 
    более объективной принято считать ту информацию, в которую методы вносят 
    меньший субъективный элемент. В ходе информационного процесса степень 
    объективности информации всегда понижается. Это свойство учитывают, 
    например, в правовых дисциплинах, где по-разному обрабатываются показания 
    лиц, непосредственно наблюдавших события или получивших информацию 
    косвенным путем посредством умозаключений или со слов третьих лиц).  
25)косвенным путем посредством умозаключений или со слов третьих лиц).
Сформулируйте правило перевода смешанных чисел из двоичной 
системы счисления в восьмеричную, шестнадцатеричную.
    Разделим данное число на целую и дробную часть. Далее  целую часть на  группы по 
    четыре цифры(если в шестнадцатеричную) или по три цифры(если в восьмеричную), 
    начиная справа. Если в крайней левой группе окажется меньше четырех цифр, то 
    дополним ее нулями. То же самое проводим и с дробной частью только теперь с лево на 
    право. если в крайней правой группе окажется меньше цифр, то дополним нулями.   
26)В чем состоит процесс дискретизации информации и в каких 
случаях он используется? Приведите примеры.
    Дискретизация информации – это процесс преобразования непрерывных аналоговых 
    сигналов особым образом, представление целого в виде набора отдельных элементов.  все 
    приборы, показывающие результаты измерения в цифрах, осуществляют дискретизацию.         
"""